#### SQL활용 데이터 프레임 생성

#### python에서 pandas와의 연계를 위한 MySQL과의 연동은 다양한 방법이 있지만 그 중에서 pymyql과 SQLAlchemy가 가장 널리 사용된다.

In [1]:
! pip install pymysql
! pip install sqlalchemy
! pip install cryptography

Requirement already satisfied: pymysql in c:\users\한지은\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (1.1.0)
Requirement already satisfied: sqlalchemy in c:\users\한지은\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (2.0.17)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\한지은\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from sqlalchemy) (4.6.3)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\한지은\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from sqlalchemy) (2.0.2)
Requirement already satisfied: cryptography in c:\users\한지은\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (41.0.1)
Requirement already satisfied: cffi>=1.12 in c:\users\한지은\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from cryptography) (1.15.1)
Requirement already satisfied: pycparser in c:\users\한지은\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from cffi>=1.12->cryptography) (2.21)

#### pymysql사용

패키지 import

In [2]:
# 1) 패키지 참조
import pymysql
from sqlalchemy import create_engine
from pandas import DataFrame
from pandas import read_sql, read_sql_table

데이터 베이스 접속

In [3]:
# 2) pymysql 사용
# - pymysql은 가장 기본적인 python MySQL관련 패키지

# -1. 데이터 베이스 접속
dbcon = pymysql.connect(host="127.0.0.1", #서버주소
                        port = 3406,      #포트번호
                        user = "root",    #계정이름
                        password= "1234", #비밀번호
                        db = "board",     #데이터베이스이름
                        charset="utf8")   #인코딩

데이터 조회 (기본형태 / 딕셔너리형태)

In [4]:
# -2. 데이터 조회 (기본형태)
# step1. 데이터조회를 위한 커서객체 생성
cursor = dbcon.cursor()

# step2. 데이터조회를 위한 SQL문 처리
sql = "SELECT * FROM board_main_post"
cursor.execute(sql)
result = cursor.fetchall()
result
    #fetchall() : 레코드를 배열형식으로 저장해주는 함수

((1,
  'hello world',
  'nice to meet you',
  datetime.datetime(2023, 6, 14, 21, 44, 15, 487627),
  datetime.datetime(2023, 6, 14, 21, 44, 15, 487627),
  None),
 (2,
  'hello world',
  'nice to meet you',
  datetime.datetime(2023, 6, 14, 21, 45, 44, 568092),
  datetime.datetime(2023, 6, 14, 21, 45, 44, 568092),
  None),
 (3,
  'hello world',
  'nice to meet you',
  datetime.datetime(2023, 6, 15, 1, 1, 51, 808338),
  datetime.datetime(2023, 6, 15, 1, 1, 51, 808338),
  None),
 (4,
  'aaaa',
  'aaaaaaaaaaa',
  datetime.datetime(2023, 6, 15, 1, 3, 6, 802346),
  datetime.datetime(2023, 6, 15, 1, 3, 6, 802346),
  None),
 (5,
  'HI',
  'HELLO',
  datetime.datetime(2023, 6, 15, 1, 4, 32, 955757),
  datetime.datetime(2023, 6, 15, 1, 4, 32, 955757),
  None),
 (6,
  'hihi',
  'hihihi',
  datetime.datetime(2023, 6, 15, 1, 15, 35, 94752),
  datetime.datetime(2023, 6, 15, 1, 15, 35, 94752),
  None),
 (7,
  'hi kim',
  ' 안녕',
  datetime.datetime(2023, 6, 15, 2, 31, 42, 432315),
  datetime.datetime(2023, 6, 15, 4, 31, 22, 21319),
  None),
 (8,
  '',
  ' ',
  datetime.datetime(2023, 6, 15, 2, 42, 21, 790796),
  datetime.datetime(2023, 6, 15, 2, 42, 21, 790796),
  None),
 (9,
  '안녕',
  ' 안녕',
  datetime.datetime(2023, 6, 15, 5, 27, 40, 360161),
  datetime.datetime(2023, 6, 15, 5, 27, 40, 360161),
  1))

In [6]:
# -3. 데이터 조회 (딕셔너리 형태로 데이터 조회)
# step1. 데이터조회를 위한 커서 객체 생성
cursor = dbcon.cursor(pymysql.cursors.DictCursor)

# step2. 데이터 조회하기
sql = "SELECT * FROM board_main_post"
cursor.execute(sql)
result = cursor.fetchall()
result

# step3. 조회결과를 데이터프레임으로 변환
df = DataFrame(result)
df

# step4. 데이터 프레임에 대한 인덱스 설정
df.set_index('id', inplace=True)
df

,title,contents,created_at,updated_at,author_id
id,,,,,
1,hello world,nice to meet you,2023-06-14 21:44:15.487627,2023-06-14 21:44:15.487627,NaN
2,hello world,nice to meet you,2023-06-14 21:45:44.568092,2023-06-14 21:45:44.568092,NaN
3,hello world,nice to meet you,2023-06-15 01:01:51.808338,2023-06-15 01:01:51.808338,NaN
4,aaaa,aaaaaaaaaaa,2023-06-15 01:03:06.802346,2023-06-15 01:03:06.802346,NaN
5,HI,HELLO,2023-06-15 01:04:32.955757,2023-06-15 01:04:32.955757,NaN
6,hihi,hihihi,2023-06-15 01:15:35.094752,2023-06-15 01:15:35.094752,NaN
7,hi kim,안녕,2023-06-15 02:31:42.432315,2023-06-15 04:31:22.021319,NaN
8,,,2023-06-15 02:42:21.790796,2023-06-15 02:42:21.790796,NaN
9,안녕,안녕,2023-06-15 05:27:40.360161,2023-06-15 05:27:40.360161,1.0

데이터 입력

In [11]:
sql = """INSERT INTO board_main_post (title, contents, created_at, updated_at) VALUES ('pandas test', '이것은 테스트입니다.', now(), now())"""
# print(sql)

rows = cursor.execute(sql)
print("%d개의 행이 저장됨" %rows)
print("생성된 Primary Key: %d" % cursor.lastrowid)
#lastrowid는 db_cursor를 이용해 excute한 테이블의 마지막행 id값을 가져와준다.
dbcon.commit()

# 반대로 되돌릴 때는 dbcon.rollback()

1개의 행이 저장됨
생성된 Primary Key: 11

데이터 수정

In [13]:
sql = """UPDATE board_main_post SET title='수정된 제목', contents='수정된 내용', updated_at=now()  WHERE id=10"""
# print(sql)
rows = cursor.execute(sql)
print("%d개의 행이 갱신됨" %rows)
dbcon.commit()

1개의 행이 갱신됨

데이터 삭제

In [ ]:
sql = "DELETE FROM board_main_post WHERE id>8"
# print(sql)
rows = cursor.execute(sql)
print("%d개의 행이 삭제됨" % rows)
dbcon.commit()

데이터 접속 해제

In [ ]:
cursor.close()
dbcon.close()

#### SQLAlchemy 사용

데이터베이스 접속

In [ ]:
! pip install mysqlclient
! pip install MySQL-python

In [23]:
# 1) 접속 패키지 설치
pymysql.install_as_MySQLdb()
import MySQLdb

In [25]:
# 2) 접속 문자열 생성
# mysql+mysqldb://계정이름:비밀번호@포트번호/데이터베이스이름?charset=인코딩
conStr = "mysql+mysqldb://root:1234@127.0.0.1:3406/board?charset=utf8"
conStr

'mysql+mysqldb://root:1234@127.0.0.1:3406/board?charset=utf8'

In [26]:
# 3) 데이터베이스 접속
engine = create_engine(conStr)
conn = engine.connect()

데이터 조회

In [28]:
# 1.sql문 사용해서 데이터 조회
df = read_sql("SELECT * FROM board_main_post", index_col="id", con=conn)
df

,title,contents,created_at,updated_at,author_id
id,,,,,
1,hello world,nice to meet you,2023-06-14 21:44:15.487627,2023-06-14 21:44:15.487627,NaN
2,hello world,nice to meet you,2023-06-14 21:45:44.568092,2023-06-14 21:45:44.568092,NaN
3,hello world,nice to meet you,2023-06-15 01:01:51.808338,2023-06-15 01:01:51.808338,NaN
4,aaaa,aaaaaaaaaaa,2023-06-15 01:03:06.802346,2023-06-15 01:03:06.802346,NaN
5,HI,HELLO,2023-06-15 01:04:32.955757,2023-06-15 01:04:32.955757,NaN
6,hihi,hihihi,2023-06-15 01:15:35.094752,2023-06-15 01:15:35.094752,NaN
7,hi kim,안녕,2023-06-15 02:31:42.432315,2023-06-15 04:31:22.021319,NaN
8,,,2023-06-15 02:42:21.790796,2023-06-15 02:42:21.790796,NaN
9,안녕,안녕,2023-06-15 05:27:40.360161,2023-06-15 05:27:40.360161,1.0
10,수정된 제목,수정된 내용,2023-06-27 04:34:50.000000,2023-06-27 04:41:24.000000,NaN

In [29]:
# 2.테이블을 가져와서 데이터 조회
df = read_sql_table("board_main_post", con=conn)
df

,id,title,contents,created_at,updated_at,author_id
0,1,hello world,nice to meet you,2023-06-14 21:44:15.487627,2023-06-14 21:44:15.487627,NaN
1,2,hello world,nice to meet you,2023-06-14 21:45:44.568092,2023-06-14 21:45:44.568092,NaN
2,3,hello world,nice to meet you,2023-06-15 01:01:51.808338,2023-06-15 01:01:51.808338,NaN
3,4,aaaa,aaaaaaaaaaa,2023-06-15 01:03:06.802346,2023-06-15 01:03:06.802346,NaN
4,5,HI,HELLO,2023-06-15 01:04:32.955757,2023-06-15 01:04:32.955757,NaN
5,6,hihi,hihihi,2023-06-15 01:15:35.094752,2023-06-15 01:15:35.094752,NaN
6,7,hi kim,안녕,2023-06-15 02:31:42.432315,2023-06-15 04:31:22.021319,NaN
7,8,,,2023-06-15 02:42:21.790796,2023-06-15 02:42:21.790796,NaN
8,9,안녕,안녕,2023-06-15 05:27:40.360161,2023-06-15 05:27:40.360161,1.0
9,10,수정된 제목,수정된 내용,2023-06-27 04:34:50.000000,2023-06-27 04:41:24.000000,NaN

In [30]:
# 3. 인덱스를 지정해서 데이터 조회
df = read_sql_table('board_main_post', index_col='id', con=conn)
df

,title,contents,created_at,updated_at,author_id
id,,,,,
1,hello world,nice to meet you,2023-06-14 21:44:15.487627,2023-06-14 21:44:15.487627,NaN
2,hello world,nice to meet you,2023-06-14 21:45:44.568092,2023-06-14 21:45:44.568092,NaN
3,hello world,nice to meet you,2023-06-15 01:01:51.808338,2023-06-15 01:01:51.808338,NaN
4,aaaa,aaaaaaaaaaa,2023-06-15 01:03:06.802346,2023-06-15 01:03:06.802346,NaN
5,HI,HELLO,2023-06-15 01:04:32.955757,2023-06-15 01:04:32.955757,NaN
6,hihi,hihihi,2023-06-15 01:15:35.094752,2023-06-15 01:15:35.094752,NaN
7,hi kim,안녕,2023-06-15 02:31:42.432315,2023-06-15 04:31:22.021319,NaN
8,,,2023-06-15 02:42:21.790796,2023-06-15 02:42:21.790796,NaN
9,안녕,안녕,2023-06-15 05:27:40.360161,2023-06-15 05:27:40.360161,1.0
10,수정된 제목,수정된 내용,2023-06-27 04:34:50.000000,2023-06-27 04:41:24.000000,NaN

In [32]:
# 4. 특정 칼럼만 가져오기
df = read_sql_table('board_main_post', index_col='id', columns=['title','contents'], con=conn)
df

          title          contents
id
1   hello world  nice to meet you
2   hello world  nice to meet you
3   hello world  nice to meet you
4          aaaa       aaaaaaaaaaa
5            HI             HELLO
6          hihi            hihihi
7        hi kim                안녕
8
9            안녕                안녕
10       수정된 제목            수정된 내용

데이터 내보내기

1. name = '테이블명' 이름으로 기존 테이블이 있으면 해당 테이블의 칼럼명에 맞게 데이터를 넣을 수 있음
2. if_exists = 'append' 옵션이 있으면, 기존 테이블에 데이터를 추가로 넣음
3. if_exists = 'fail'옵션이 있으면, 기존 테이블이 있을 경우 아무일도 하지 않음.
4. if_exists = 'replace' 옵션이 있으면, 기존 테이블이 있을 경우 기존테이블을 삭제하고 다시 테이블을 만들어서 새로운데이터를 넣음.

In [33]:
df.to_sql(name='new_table',con=conn, if_exists='append', index=False)
conn.commit()

데이터베이스 접속해제

In [34]:
conn.close()